In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('train.csv')

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [31]:
df['Titless'] = df['Name'].apply(lambda x: x.split(',')[1].split('.')[0].strip())

In [32]:
title = dict()
for i,n in enumerate(df['Name']):
    title[i] = n.split()[1]

In [33]:
type(title)

dict

In [34]:
df['Title'] = pd.Series(title)

In [39]:
df[['Name','Title','Titless']]

                                                  Name  Title Titless
0                              Braund, Mr. Owen Harris    Mr.      Mr
1    Cumings, Mrs. John Bradley (Florence Briggs Th...   Mrs.     Mrs
2                               Heikkinen, Miss. Laina  Miss.    Miss
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)   Mrs.     Mrs
4                             Allen, Mr. William Henry    Mr.      Mr
..                                                 ...    ...     ...
886                              Montvila, Rev. Juozas   Rev.     Rev
887                       Graham, Miss. Margaret Edith  Miss.    Miss
888           Johnston, Miss. Catherine Helen "Carrie"  Miss.    Miss
889                              Behr, Mr. Karl Howell    Mr.      Mr
890                                Dooley, Mr. Patrick    Mr.      Mr

[891 rows x 3 columns]

In [36]:
df['Title'].unique()

array(['Mr.', 'Mrs.', 'Miss.', 'Master.', 'Planke,', 'Don.', 'Rev.',
       'Billiard,', 'der', 'Walle,', 'Dr.', 'Pelsmaeker,', 'Mulder,', 'y',
       'Steen,', 'Carlo,', 'Mme.', 'Impe,', 'Ms.', 'Major.', 'Gordon,',
       'Messemaeker,', 'Mlle.', 'Col.', 'Capt.', 'Velde,', 'the',
       'Shawah,', 'Jonkheer.', 'Melkebeke,', 'Cruyssen,'], dtype=object)

In [40]:
df['Titless'].unique()

array(['Mr', 'Mrs', 'Miss', 'Master', 'Don', 'Rev', 'Dr', 'Mme', 'Ms',
       'Major', 'Lady', 'Sir', 'Mlle', 'Col', 'Capt', 'the Countess',
       'Jonkheer'], dtype=object)

In [42]:
df['Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [44]:
def extract_title(name):
    return name.split(',')[1].split('.')[0].strip()

df['Title_fun'] = df['Name'].apply(extract_title)

In [46]:
df['Title_fun'].unique()

array(['Mr', 'Mrs', 'Miss', 'Master', 'Don', 'Rev', 'Dr', 'Mme', 'Ms',
       'Major', 'Lady', 'Sir', 'Mlle', 'Col', 'Capt', 'the Countess',
       'Jonkheer'], dtype=object)